Revit 2027 API
RebarInSystem.Mass Property
 Identifies the mass of the rebar set. It is computed as the sum of the masses of all individual bars.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Mass { get; }
Public ReadOnly Property Mass As Double
	Get
public:
property double Mass {
	double get ();
}
member Mass : float with get
Property Value
Double
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace